GopalSaraf/Practicals/PSDL/include/proc/pic18lf8622.inc
// Register: PORTJ
#define PORTJ PORTJ
PORTJ                                    equ 0F88h
// bitfield definitions
PORTJ_RJ0_POSN                           equ 0000h
PORTJ_RJ0_POSITION                       equ 0000h
PORTJ_RJ0_SIZE                           equ 0001h
PORTJ_RJ0_LENGTH                         equ 0001h
PORTJ_RJ0_MASK                           equ 0001h
PORTJ_RJ1_POSN                           equ 0001h
PORTJ_RJ1_POSITION                       equ 0001h
PORTJ_RJ1_SIZE                           equ 0001h
PORTJ_RJ1_LENGTH                         equ 0001h
PORTJ_RJ1_MASK                           equ 0002h
PORTJ_RJ2_POSN                           equ 0002h
PORTJ_RJ2_POSITION                       equ 0002h
PORTJ_RJ2_SIZE                           equ 0001h
PORTJ_RJ2_LENGTH                         equ 0001h
PORTJ_RJ2_MASK                           equ 0004h
PORTJ_RJ3_POSN                           equ 0003h
PORTJ_RJ3_POSITION                       equ 0003h
PORTJ_RJ3_SIZE                           equ 0001h
PORTJ_RJ3_LENGTH                         equ 0001h
PORTJ_RJ3_MASK                           equ 0008h
PORTJ_RJ4_POSN                           equ 0004h
PORTJ_RJ4_POSITION                       equ 0004h
PORTJ_RJ4_SIZE                           equ 0001h
PORTJ_RJ4_LENGTH                         equ 0001h
PORTJ_RJ4_MASK                           equ 0010h
PORTJ_RJ5_POSN                           equ 0005h
PORTJ_RJ5_POSITION                       equ 0005h
PORTJ_RJ5_SIZE                           equ 0001h
PORTJ_RJ5_LENGTH                         equ 0001h
PORTJ_RJ5_MASK                           equ 0020h
PORTJ_RJ6_POSN                           equ 0006h
PORTJ_RJ6_POSITION                       equ 0006h
PORTJ_RJ6_SIZE                           equ 0001h
PORTJ_RJ6_LENGTH                         equ 0001h
PORTJ_RJ6_MASK                           equ 0040h
PORTJ_RJ7_POSN                           equ 0007h
PORTJ_RJ7_POSITION                       equ 0007h
PORTJ_RJ7_SIZE                           equ 0001h
PORTJ_RJ7_LENGTH                         equ 0001h
PORTJ_RJ7_MASK                           equ 0080h
PORTJ_ALE_POSN                           equ 0000h
PORTJ_ALE_POSITION                       equ 0000h
PORTJ_ALE_SIZE                           equ 0001h
PORTJ_ALE_LENGTH                         equ 0001h
PORTJ_ALE_MASK                           equ 0001h
PORTJ_OE_POSN                            equ 0001h
PORTJ_OE_POSITION                        equ 0001h
PORTJ_OE_SIZE                            equ 0001h
PORTJ_OE_LENGTH                          equ 0001h
PORTJ_OE_MASK                            equ 0002h
PORTJ_WRL_POSN                           equ 0002h
PORTJ_WRL_POSITION                       equ 0002h
PORTJ_WRL_SIZE                           equ 0001h
PORTJ_WRL_LENGTH                         equ 0001h
PORTJ_WRL_MASK                           equ 0004h
PORTJ_WRH_POSN                           equ 0003h
PORTJ_WRH_POSITION                       equ 0003h
PORTJ_WRH_SIZE                           equ 0001h
PORTJ_WRH_LENGTH                         equ 0001h
PORTJ_WRH_MASK                           equ 0008h
PORTJ_BA0_POSN                           equ 0004h
PORTJ_BA0_POSITION                       equ 0004h
PORTJ_BA0_SIZE                           equ 0001h
PORTJ_BA0_LENGTH                         equ 0001h
PORTJ_BA0_MASK                           equ 0010h
PORTJ_CE_POSN                            equ 0005h
PORTJ_CE_POSITION                        equ 0005h
PORTJ_CE_SIZE                            equ 0001h
PORTJ_CE_LENGTH                          equ 0001h
PORTJ_CE_MASK                            equ 0020h
PORTJ_LB_POSN                            equ 0006h
PORTJ_LB_POSITION                        equ 0006h
PORTJ_LB_SIZE                            equ 0001h
PORTJ_LB_LENGTH                          equ 0001h
PORTJ_LB_MASK                            equ 0040h
PORTJ_UB_POSN                            equ 0007h
PORTJ_UB_POSITION                        equ 0007h
PORTJ_UB_SIZE                            equ 0001h
PORTJ_UB_LENGTH                          equ 0001h
PORTJ_UB_MASK                            equ 0080h
PORTJ_NOT_OE_POSN                        equ 0001h
PORTJ_NOT_OE_POSITION                    equ 0001h
PORTJ_NOT_OE_SIZE                        equ 0001h
PORTJ_NOT_OE_LENGTH                      equ 0001h
PORTJ_NOT_OE_MASK                        equ 0002h
PORTJ_NOT_WRL_POSN                       equ 0002h
PORTJ_NOT_WRL_POSITION                   equ 0002h
PORTJ_NOT_WRL_SIZE                       equ 0001h
PORTJ_NOT_WRL_LENGTH                     equ 0001h
PORTJ_NOT_WRL_MASK                       equ 0004h
PORTJ_NOT_WRH_POSN                       equ 0003h
PORTJ_NOT_WRH_POSITION                   equ 0003h
PORTJ_NOT_WRH_SIZE                       equ 0001h
PORTJ_NOT_WRH_LENGTH                     equ 0001h
PORTJ_NOT_WRH_MASK                       equ 0008h
PORTJ_NOT_CE_POSN                        equ 0005h
PORTJ_NOT_CE_POSITION                    equ 0005h
PORTJ_NOT_CE_SIZE                        equ 0001h
PORTJ_NOT_CE_LENGTH                      equ 0001h
PORTJ_NOT_CE_MASK                        equ 0020h
PORTJ_NOT_LB_POSN                        equ 0006h
PORTJ_NOT_LB_POSITION                    equ 0006h
PORTJ_NOT_LB_SIZE                        equ 0001h
PORTJ_NOT_LB_LENGTH                      equ 0001h
PORTJ_NOT_LB_MASK                        equ 0040h
PORTJ_NOT_UB_POSN                        equ 0007h
PORTJ_NOT_UB_POSITION                    equ 0007h
PORTJ_NOT_UB_SIZE                        equ 0001h
PORTJ_NOT_UB_LENGTH                      equ 0001h
PORTJ_NOT_UB_MASK                        equ 0080h
PORTJ_nOE_POSN                           equ 0001h
PORTJ_nOE_POSITION                       equ 0001h
PORTJ_nOE_SIZE                           equ 0001h
PORTJ_nOE_LENGTH                         equ 0001h
PORTJ_nOE_MASK                           equ 0002h
PORTJ_nWRL_POSN                          equ 0002h
PORTJ_nWRL_POSITION                      equ 0002h
PORTJ_nWRL_SIZE                          equ 0001h
PORTJ_nWRL_LENGTH                        equ 0001h
PORTJ_nWRL_MASK                          equ 0004h
PORTJ_nWRH_POSN                          equ 0003h
PORTJ_nWRH_POSITION                      equ 0003h
PORTJ_nWRH_SIZE                          equ 0001h
PORTJ_nWRH_LENGTH                        equ 0001h
PORTJ_nWRH_MASK                          equ 0008h
PORTJ_nCE_POSN                           equ 0005h
PORTJ_nCE_POSITION                       equ 0005h
PORTJ_nCE_SIZE                           equ 0001h
PORTJ_nCE_LENGTH                         equ 0001h
PORTJ_nCE_MASK                           equ 0020h
PORTJ_nLB_POSN                           equ 0006h
PORTJ_nLB_POSITION                       equ 0006h
PORTJ_nLB_SIZE                           equ 0001h
PORTJ_nLB_LENGTH                         equ 0001h
PORTJ_nLB_MASK                           equ 0040h
PORTJ_nUB_POSN                           equ 0007h
PORTJ_nUB_POSITION                       equ 0007h
PORTJ_nUB_SIZE                           equ 0001h
PORTJ_nUB_LENGTH                         equ 0001h
PORTJ_nUB_MASK                           equ 0080h

